# RasterSymbolLinkloadStatus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterSymbolLinkloadStatus Property
ParameterTypeId Class See Also
---
"Link Status"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterSymbolLinkloadStatus { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterSymbolLinkloadStatus As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterSymbolLinkloadStatus {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace